testing-scripts/test_multi-client_encrypted_h2load_throughput_via-B/results/payload-size_1000000000____delay-ms_0____loss-rate-percent_0____clients-requests_10/8/result.txt
starting benchmark...
spawning thread #0: 10 total client(s). 10 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h3
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 108.13s, 0.09 req/s, 88.22MB/s
requests: 10 total, 10 started, 10 done, 10 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 10 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 9.32GB (10003052540) total, 140B (140) headers (space savings 85.57%), 9.31GB (10000000000) data
UDP datagram: 362979 sent, 8213298 received
                     min         max         mean         sd        +/- sd
time for request:     99.90s     108.12s     105.11s       3.04s    80.00%
time for connect:     4.16ms     26.75ms     15.46ms      7.66ms    60.00%
time to 1st byte:    26.48ms     30.39ms     28.39ms      1.43ms    60.00%
req/s           :       0.01        0.01        0.01        0.00    80.00%